app/controllers/api/v1/customers_controller.rb

SELECT "customers".* FROM "customers" ORDER BY description ASC
---
      def index
        @customers = Customer.all

UPDATE "customers" SET "status" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["status", "inactive"], ["updated_at", "2022-11-05 00:49:44.924664"], ["id", 1]]
---
      def update
        @customer.update(customer_params)