app/controllers/api/v1/customers_controller.rb

      def index
        @customers = Customer.select(:id, :description, :status)
---
SELECT "customers"."id", "customers"."description", "customers"."status" FROM "customers"

      def create
        @customer = Customer.new(customer_params)
        @customer.save!
---
INSERT INTO "customers" ("description", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "New customer"], ["status", "active"], ["created_at", "2022-11-07 15:30:10.716373"], ["updated_at", "2022-11-07 15:30:10.716373"]]

      def update
        @customer.update(customer_params)
---
UPDATE "customers" SET "status" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["status", "inactive"], ["updated_at", "2022-11-07 12:36:09.437752"], ["id", 1]]

      def destroy
        @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 1]]

      def set_customer
        @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]