app/controllers/api/v1/drivers_controller.rb

      def index
        @drivers = Driver.all.order(:first_name)
---
SELECT "drivers".* FROM "drivers" ORDER BY first_name DESC