app/controllers/api/v1/drivers_controller.rb

      def index
        @drivers =
          Driver.select(
            :id,
            :full_name,
            :first_name,
            :last_name,
            :document,
            :shipping_company,
          ).order(:first_name)
---
SELECT "drivers"."id", "drivers"."first_name", "drivers"."last_name", "drivers"."document", "drivers"."shipping_company" FROM "drivers" ORDER BY "drivers"."first_name" ASC

      def create
        @driver = Driver.new(driver_params)
        @driver.save!
---
INSERT INTO "drivers" ("first_name", "last_name", "document", "shipping_company", "created_at", "updated_at", "full_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

      def update
        @driver.update(driver_params)
---
UPDATE "drivers" SET "first_name" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["first_name", "blaaaaaaaa"], ["updated_at", "2022-11-07 01:42:50.238206"], ["id", 1]]

      def destroy
        @driver.destroy
---
DELETE FROM "drivers" WHERE "drivers"."id" = $1  [["id", 1]]

      def set_driver
        @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]