app/controllers/api/v1/shipments_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]
SELECT "shipments"."id" FROM "shipments" ORDER BY "shipments"."created_at" ASC
---
      def index
        @shipments = Shipment.all.includes(:driver, :vehicle, :customer).order(:created_at)

INSERT INTO "shipments" ("driver_id", "vehicle_id", "customer_id", "invoice_number", "cargo_checker", "dock", "kind", "warehouse", "internship", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
      def create
        @shipment = Shipment.new(shipment_params)
        @shipment.save!

UPDATE "shipments" SET "internship" = $1, "updated_at" = $2 WHERE "shipments"."id" = $3  [["internship", "finished"], ["updated_at", "2022-11-07 21:40:26.664084"], ["id", 2]]
INSERT INTO "shipments" ("driver_id", "vehicle_id", "customer_id", "invoice_number", "cargo_checker", "dock", "kind", "warehouse", "internship", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
      def update
        @shipment.update(shipment_params)
        if shipment_params[:status] && shipment_params[:status] == 'ready'
          CompletedShipment.create!(user_id: current_user.id,
                                    shipment_id: @shipment.id)

DELETE FROM "shipments" WHERE "shipments"."id" = $1  [["id", 1]]
---
      def destroy
        @shipment.destroy

SELECT "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_shipment
        @shipment = Shipment.find(params[:id])