app/controllers/api/v1/vehicles_controller.rb

      def index
        @vehicles =
          Vehicle.select(
            :id,
            :manufacturer,
            :sample,
            :license_plate,
            :bodywork,
          ).order(:manufacturer)
---
SELECT "vehicles"."id", "vehicles"."manufacturer", "vehicles"."sample", "vehicles"."license_plate", "vehicles"."bodywork" FROM "vehicles" ORDER BY "vehicles"."manufacturer" ASC

      def create
        @vehicle = Vehicle.new(vehicle_params)
        @vehicle.save!
---
INSERT INTO "vehicles" ("manufacturer", "model", "vehicle_type", "license_plate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

      def update
        @vehicle.update(vehicle_params)
---
UPDATE "vehicles" SET "license_plate" = $1, "updated_at" = $2 WHERE "vehicles"."id" = $3  [["license_plate", "BCA-3214"], ["updated_at", "2022-11-07 12:28:33.968838"], ["id", 1]]

      def destroy
        @vehicle.destroy
---
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 1]]

      def set_vehicle
        @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]