app/controllers/users/sessions_controller.rb

  def respond_to_on_destroy
    jwt_payload =
      JWT.decode(
        request.headers["Authorization"].split(" ")[1],
        Rails.application.credentials.fetch(:secret_key_base),
      ).first
    current_user = User.find(jwt_payload["sub"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]